layers/+irc/erc/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-23 Mon 13:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ERC contribution layer for Spacemacs</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css"
                 href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/readtheorg.css" />
</head>
<body>
<div id="content">
<div id="toggle-sidebar"><a href="#table-of-contents"><h2>Table of Contents</h2></a></div>
<h1 class="title">ERC contribution layer for Spacemacs</h1>
<div id="table-of-contents">
<h2>Table of Contents<a href="#">Close</a></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Description</a></li>
<li><a href="#orgheadline2">2. Features</a></li>
<li><a href="#orgheadline6">3. Install</a>
<ul>
<li><a href="#orgheadline3">3.1. Layer</a></li>
<li><a href="#orgheadline4">3.2. OS X</a></li>
<li><a href="#orgheadline5">3.3. Social graph</a></li>
</ul>
</li>
<li><a href="#orgheadline7">4. Key bindings</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
Layer for <a href="http://www.emacswiki.org/emacs/ERC">ERC IRC chat</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Features</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Highlight nicks (using <a href="https://github.com/leathekd/erc-hl-nicks">erc-hl-nicks</a>)</li>
<li>Image inline support (using <a href="https://github.com/kidd/erc-image.el">erc-image</a>)</li>
<li>Logging to ~/.emacs.d/.cache/erc-logs and ViewLogMode for viewing logs
(using <a href="https://github.com/Niluge-KiWi/erc-view-log">erc-view-log</a>)</li>
<li>YouTube videos Thumbnails inline (using <a href="https://github.com/yhvh/erc-yt">erc-yt</a>)</li>
<li>Social Graph for ERC messages (using <a href="https://github.com/vibhavp/erc-social-graph">erc-social-graph</a>)</li>
<li>ERC yank, if pasting more than 5 lines, create a gist for it. (needs to have
<code>github</code> layer enabled, or using <code>gist</code> package)</li>
<li>Optional SASL authentication via the variable <code>erc-enable-sasl-auth</code>
  (using <a href="http://emacswiki.org/emacs/ErcSASL">erc-sasl</a>)</li>
<li>Gitter support! This includes clickable issue numbers, inline markdown
highlighting, and more (check package doc). Go to irc.gitter.im to get
credentials and use erc-tls to connect ( <code>SPC a i E</code> ).</li>
<li>Completion of Emojis using <a href="https://github.com/dunn/company-emoji">company-emoji</a> (still needs a way of showing, either
using the <code>emoji</code> layer or having a proper font) :clap:</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">3</span> Install</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> Layer</h3>
<div class="outline-text-3" id="text-3-1">
<p>
To use this contribution add it to your <code>~/.spacemacs</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers '<span class="org-rainbow-delimiters-depth-2">(</span>erc<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.2</span> OS X</h3>
<div class="outline-text-3" id="text-3-2">
<p>
It's recommended to install the <a href="https://github.com/alloy/terminal-notifier">terminal-notifier gem</a> so that you get
notifications via the OS X Notification Center.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">3.3</span> Social graph</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<a href="https://github.com/vibhavp/erc-social-graph">erc-social-graph</a> needs graphviz to be installed on your system.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">4</span> Key bindings</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Binding</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>SPC a i e</code></td>
<td class="org-left">Starts ERC</td>
</tr>

<tr>
<td class="org-left"><code>SPC a i E</code></td>
<td class="org-left">Starts ERC via TLS/SSL</td>
</tr>

<tr>
<td class="org-left"><code>SPC a i i</code></td>
<td class="org-left">Switch to next active ERC buffer</td>
</tr>

<tr>
<td class="org-left"><code>SPC m b</code></td>
<td class="org-left">Switch between ERC buffers</td>
</tr>

<tr>
<td class="org-left"><code>SPC m d</code></td>
<td class="org-left">Interactively input a user action and send it to IRC.</td>
</tr>

<tr>
<td class="org-left"><code>SPC m D</code></td>
<td class="org-left">Draw Social Graph using  <a href="https://github.com/vibhavp/erc-social-graph">erc-social-graph</a></td>
</tr>

<tr>
<td class="org-left"><code>SPC m j</code></td>
<td class="org-left">Join a channel, executes the /join command</td>
</tr>

<tr>
<td class="org-left"><code>SPC m n</code></td>
<td class="org-left">Run "/names #channel" in the current channel.</td>
</tr>

<tr>
<td class="org-left"><code>SPC m l</code></td>
<td class="org-left">Run the /list command</td>
</tr>

<tr>
<td class="org-left"><code>SPC m p</code></td>
<td class="org-left">Part from the channel</td>
</tr>

<tr>
<td class="org-left"><code>SPC m q</code></td>
<td class="org-left">Quit server</td>
</tr>
</tbody>
</table>

<p>
<b>Note:</b> If you want to connect securely to an IRC server, you must run <code>erc-tls</code>
     command on <code>SPC a i E</code> instead of the <code>erc</code> command.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-11-23 Mon 13:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
